Revit 2024 API
BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutFailure Property
 Fail to generate the automatic landing layout
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsAutomaticLandingLayoutFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsAutomaticLandingLayoutFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsAutomaticLandingLayoutFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace